Repository: adrienjacob/dataviewer
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# field_class_does_not_exist
source: A field class '%s' does not exist!
de: Ein Feld mit der Klasse '%s' existiert nicht!

# flexform.eq
source: Equal (eq)
de: Gleich (eq)

# flexform.neq
source: Not Equal (neq)
de: Nicht gleich (neq)

# flexform.like
source: Like (like)
de: Ähnlich (like)

# flexform.nlike
source: Not Like (nlike)
de: Nicht ähnlich (nlike)

# flexform.nin
source: Not In (nin)
de: Nicht in (nin)

# flexform.gt
source: Greater Than (gt)
de: Größer als (gt)

# flexform.lt
source: Lower Than (lt)
de: Kleiner als (lt)

# flexform.gteq
source: Greater Than or Equal (gteq)
de: Größer als oder gleich (gteq)

# flexform.lteq
source: Lower Than or Equal (lteq)
de: Kleiner als oder gleich (lteq)

# flexform.null
source: Is Null (null)
de: Ist Null (null)

# flexform.notnull
source: Is Not Null (notnull)
de: Ist nicht Null (notnull)

# flexform.fis
source: Single Value of a comma-separated List (FIND_IN_SET)
de: Einzelner Wert einer komma-separierten Liste (FIND_IN_SET)

# showing_records_per_page
source: Showing %s Records per Page
de: Zeige %s Datensätze pro Seite

# searching_for
source: Searching for '%s'
de: Suche nach '%s'

source: Record Title
de: Datensatztitel

source: No preselection
de: Keine Vorauswahl

source: Backend Settings
de: Backend Einstellungen

source: Frontend Settings
de: Frontend Einstellungen

source: Selected Datatype
de: Ausgewählter Datentyp

source: Selected Record
de: Ausgewählter Datensatz

source: Selected Field
de: Ausgewähltes Feld

source: On this page
de: Auf dieser Seite

source: On other pages
de: Auf anderen Seiten

source: Selection invalid
de: Auswahl ungültig

# please_regard_selection_limit
source: Please regard the selection limit of %s entries.
de: Bitte beachten Sie die Auswahllimitierung auf max. %s Einträge.

# sort.asc
source: Ascending
de: Aufsteigend

# sort.desc
source: Descending
de: Absteigend

# sort.sort_by
source: Sort by
de: Sortieren nach

# sort.sort_order
source: Sort Order
de: Sortierung

# sort.per_page
source: Items per Page
de: Einträge pro Seite

# sort.record_title
source: Title
de: Titel

# sort.record_sorting
source: Sorting
de: Sortierung

# sort.record_datatype
source: Type of the record
de: Datensatztyp

# sort.record_tstamp
source: Last changed
de: Änderungsdatum

# sort.record_crdate
source: Creation Date
de: Erstellungsdatum

# sort.record_starttime
source: Access Starttime
de: Zugriff Start

# sort.record_endtime
source: Access Endtime
de: Zugriff Ende

# sort.random
source: Random
de: Zufällig

# tab.general
source: General
de: Allgemein

# type.datatype
source: Inline Relation Datatype
de: Inline Beziehung zu Datentyp

# type.select
source: Select Field
de: Auswahlfeld

# type.multiselect
source: Multiselect Field
de: Mehrfachauswahlfeld

# type.group
source: Group Field
de: Gruppenfeld

# type.checkbox
source: Checkboxes
de: Checkboxen

# type.textarea
source: Textarea
de: Textbereich

# type.input
source: Input Field
de: Eingabefeld

# type.database
source: Database Records
de: Datenbank-Einträge

# type.dynamic_input
source: Dynamic Input Fields
de: Dynamische Eingabefelder

# type.date
source: Date Field
de: Datum

# type.flex
source: Flexform Field
de: Flexform

# type.datetime
source: Date and Time Field
de: Datum und Zeit

# type.image
source: Image
de: Bild

# type.inline
source: Inline Elements
de: Inline Elemente

# type.file_relation
source: File Relations
de: Dateirelationen

# type.file
source: File
de: Datei

# type.page
source: Page
de: Seite

# type.category
source: Category Selection
de: Kategorieauswahl

# type.rte
source: Rich-Text Editor (RTE)
de: Rich-Text HTML Editor (RTE)

# type.hidden
source: Hidden, passed Frontend
de: Versteckt, Weitergabe zum Frontend

# variable_type.0
source: Fixed Value
de: Fester Wert

# variable_type.1
source: TypoScript Value
de: TypoScript Wert

# variable_type.5
source: Fixed Record
de: Fester Datensatz

# variable_type.6
source: Record Field Value
de: Feldwert aus Datensatz

# variable_type.7
source: Database Value
de: Datenbankwert

# variable_type.8
source: Frontend User
de: Frontend Benutzer

# variable_type.10
source: Dynamic Record (from LinkViewHelper)
de: Dynamischer Datensatz (aus LinkViewHelper)

# variable_type.11
source: User Session Variable
de: Variable aus Benutzersession

# variable_type.12
source: Page
de: Seite

# type.0
source: Fixed Value
de: Fester Wert

# type.1
source: Database Value
de: Datenbankwert

# type.3
source: All Values of a Field
de: Alle Werte eines Feldes

source: Value Content
de: Wertinhalt

source: Default
de: Standard

source: Filter
de: Filtern

source: Reset
de: Zurücksetzen

source: Select
de: Auswählen

# flexform.validation
source: Validation
de: Validierung

# flexform.validation_configuration
source: Validator Configuation
de: Validator Konfiguration

# flexform.category_sources
source: Category Sources
de: Kategorie Quellen

# validator.alphanumeric
source: AlphaNumeric
de: Alphanummerisch

# validator.boolean
source: Boolean Expression
de: Boolscher Ausdruck

# validator.datetime
source: DateTime
de: Datum und Zeit

# validator.email
source: E-Mail Address
de: E-Mail Adresse

# validator.float
source: Float Value
de: Kommazahlenwert (Float)

# validator.integer
source: Integer Value
de: Zahlenwert (Integer)

# validator.not_empty
source: Not Empty Value
de: Nicht leer

# validator.number_range
source: Number Range
de: Nummernbereich

# validator.number
source: Numeric
de: Nummerisch

# validator.reg_ex
source: Regular Expression (RegEx)
de: Regulärer Ausdruck (RegEx)

# validator.strlen
source: String Length
de: Zeichenlänge

# validator.string
source: String
de: Textwert

# validation.is
source: is
de: ist

# validation.true
source: true (1)
de: wahr (1)

# validation.false
source: false (0)
de: unwahr (0)

# mlang_labels_tablabel
source: DataViewer Record management
de: DataViewer Datensatz-Management

# mlang_labels_tabdescr
source: This module manages records of different type. You can easily manage or add records to the selected page.
de: Dieses Modul dient zur Verwaltung von allen DataViewer Komponenten. Die können neue Datensätze oder Datentypen auf der ausgewählten Seite anlegen oder verwalten.

# module.records
source: Manage Records
de: Datensätze verwalten

# module.datatypes
source: Manage Datatypes
de: Datentypen verwalten

# module.datatypes_information
source: Datatypes Information
de: Informationen zu Datentypen

# module.records_information
source: Records Information
de: Informationen zu Datensätzen

# module.csv_import
source: CSV Import Assistant
de: CSV Import Assistent

# module.records_on_this_page
source: Records on this page
de: Datensätze auf dieser Seite

# module.datatypes_on_this_page
source: Datatypes on this page
de: Datentypen auf dieser Seite

# module.number_of_records
source: There are %s records on this page
de: Es befinden sich %s Datensätze auf dieser Seite

# module.number_of_datatypes
source: There are %s datatypes on this page
de: Es befinden sich %s Datentypen auf dieser Seite

# module.search_placeholder
source: Searchstring
de: Suchwort

# module.create_a_new_record_on_this_page
source: Create a new record on this page
de: Neuen Datensatz auf dieser Seite erstellen

# module.create_record_by_datatype
source: Create new '%s'-Record
de: Neuen '%s'-Datensatz erstellen

# module.no_records_found
source: No records were found on this page.
de: Es befinden sich keine Datensätze auf dieser Seite.

# module.no_datatypes_found
source: No datatypes were found on this page.
de: Es befinden sich keine Datentypen auf dieser Seite.

# module.new_datatype
source: Create new datatype
de: Neuen Datentyp erstellen

# module.new_field
source: Create new field
de: Neues Feld erstellen

# module.click_on_entry_to_open_details
source: Please click on an entry in the following table to open details for the selected entry.
de: Bitte klicken Sie auf einen Eintrag um Details zu öffnen.

# module.please_select_a_page
source: Please select a page in the pagetree.
de: Bitte wählen Sie eine Seite im Seitenbaum aus.

# module.import_step1
source: Please select a page from the pagetree, where the imported records will be stored.
de: Bitte wählen Sie eine Seite aus dem Seitenbaum in welcher die importierten Datensätze gespeichert werden sollen.

# module.import_step2
source: Please select the target datatype for the imported records. This datatype is used for assigning the data of the imported file.
de: Bitte wählen Sie den Ziel-Datentyp aus für die zu importierenden Datensätze. Dieser Datentyp wird benutzt um die importierten Daten einem Datentyp zuzuordnen.

# module.import_step3
source: Please select the CSV-File from your computer. The file is uploaded once into a temporary directory and will be deleted from the server after the import is finished.
de: Bitte wählen Sie die CSV-Datei von Ihrem Computer aus. Die Datei wird in ein temporäres Verzeichnis geladen und nach dem Import wieder vom Server gelöscht.

# module.import_step4
source: Please assign the columns from the CSV-File to the according field of the datatype. All data of this column will be imported to the selected field if the validation is passed.
de: Bitte weisen Sie die Spalten der CSV-Datei zum passenden Feld des Datentyps zu. Die Daten der Spalte werden dann in das ausgewählte Feld importiert nachdem die Validierung erfolgreich war.

# module.import_step5
source: Thank you for using the DataViewer CSV-Import. The final log is displayed in the following lines.
de: Vielen Dank für die Benutzung des DataViewer CSV-Import. Die finale Log finden Sie im Folgenden.

# module.imported
source: Imported
de: Importiert

# module.not_imported
source: Not imported
de: Nicht importiert

# module.import_successful
source: Import successful!
de: Import erfolgreich!

# module.import_error
source: Import error! Record is deactivated.
de: Importfehler! Datensatz wurde deaktiviert.

# module.csv_file
source: CSV File
de: CSV Datei

# module.csv_divider
source: CSV Divider Character
de: CSV Trennzeichen

# module.csv_first_line
source: First Line is Header with column names
de: Erste Zeile ist Kopf mit Spaltennamen

# module.csv_field_enclosure
source: Field Enclosure
de: Feld-Umschließung

# module.no_file_given
source: No file given. Please select a file to continue.
de: Keine Datei angegeben. Bitte wählen Sie eine Datei aus um fortzufahren.

# module.file_empty
source: The selected file is empty or cannot be read. Please try again!
de: Die angegebene Datei ist leer oder kann nicht gelesen werden. Bitte versuchen Sie es nochmals!

# module.csv_target_page
source: Select Target Page
de: Zielseite wählen

# module.csv_target_datatype
source: Select Target Datatype
de: Ziel-Datentyp wählen

# module.csv_source_file
source: Select Source CSV File
de: Quell-CSV-Datei wählen

# module.csv_assign_fields
source: Assign Fields to Columns
de: Feldern zu Spalten zuordnen

# module.csv_review_log
source: Review Log
de: Log ansehen

# module.csv_assigned_column
source: Assigned Column
de: Zugewiesene Spalte

# module.csv_not_assigned
source: Not assigned (Empty)
de: Nicht zugewiesen (Leer)

# module.csv_custom_value
source: Custom Value for all records
de: Eigener Wert für alle Datensätze

# module.csv_contents
source: CSV File Contents
de: CSV Dateiinhalte

# module.csv_start_import
source: Start Import
de: Importieren starten

# module.csv_log_messages
source: Messages
de: Ausgaben

# module.csv_log_line_number
source: Line Number
de: Zeilennummer

# module.create
source: Create
de: Erstellen

# module.create_record
source: Create Record
de: Datensatz erstellen

# module.manage
source: Manage
de: Verwalten

# module.no_description_available
source: No description available
de: Keine Beschreibung verfügbar
