Repository: adrienjacob/dataviewer
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# flexform.please_select
source: -- Please select --
de: -- Bitte auswählen --

# flexform.general_settings
source: DataViewer Settings
de: DataViewer Einstellungen

# flexform.developer_settings
source: Developer Settings
de: Entwickler

# flexform.display_settings
source: Display Settings
de: Anzeigeeinstellungen

# flexform.template_settings
source: Template Settings
de: Template Einstellungen

# flexform.plugin_type
source: Plugin Type
de: Plugintyp

# flexform.no_plugin_type_selected
source: No Plugin Type selected
de: Kein Plugintyp ausgewählt

# flexform.available_markers
source: Available Markers
de: Verfügbare Marker

# flexform.record_selection_type
source: Record Selection Type / Allow or Show records by selection type
de: Datensatz Auswahltyp / Erlauben oder Anzeigen von Datensätzen nach Auswahltyp

# flexform.selection_type
source: Selection Type
de: Auswahltyp

# flexform.selection_by_datatype
source: Selection by Datatype
de: Auswahl nach Datentyp

# flexform.selection_by_single_records
source: Selection by Records
de: Auswahl nach Datensätzen

# flexform.selection_by_plugin
source: Selection by Selection-Plugin
de: Auswahl von Auswahl-Plugin

# flexform.selection_by_creation_date
source: Selection by Creation Date
de: Auswahl nach Erstellungsdatum der Datensätze

# flexform.selection_by_change_date
source: Selection by Change Date
de: Auswahl nach Änderungsdatum der Datensätze

# flexform.selection_by_all
source: All Records on selected Storage Page(s)
de: Alle Einträge aus ausgewählten Datenordnern

# flexform.datatype_selection
source: Datatype
de: Datentyp

# flexform.record_selection
source: Record
de: Datensatz

# flexform.records_selection
source: Records
de: Datensätze

# flexform.datetime_selection
source: Records by creation date
de: Datensätze nach Erstellungsdatum

# flexform.date_from_selection
source: Date from
de: Datum von

# flexform.date_to_selection
source: Date to
de: Datum bis

# flexform.selection_by_field_value_filter
source: Records by field/value filter
de: Datensätze nach Feld/Wert Filter

# flexform.target_plugin
source: Target record display plugin, which will follow this plugin
de: Zielplugin der Datensatz-Anzeige, welches diesem Plugin folgt

# flexform.field_value_filter_setting
source: Field/Value Filter Settings
de: Feld/Wert Filtereinstellungen

# flexform.field_value_filter_information_note
source: Information about the Field/Value Filter Settings
de: Informationen zu Feld/Wert Filtereinstellungen

# flexform.field_search_setting
source: Field Search Settings
de: Feld-Suche Einstellungen

# flexform.field_search_information_note
source: Field Search Information
de: Feld-Suche Informationen

# flexform.search_fields
source: Fields for search
de: Felder für Suche

# flexform.minimum_chars
source: Minimum chars for search
de: Mindestlänge für die Suche

# flexform.clear_on_page_load
source: Clear on Page Load
de: Suchfelder leeren bei Reload

# flexform.variable_injection
source: Variable Injection
de: Variablen hinzufügen

# flexform.selection_limit
source: Selection Limit
de: Auswahllimitierung

# flexform.label_field
source: Field for Option Label
de: Feld für Option Label

# flexform.field_filter
source: Field for filtering
de: Feld für Filtern

# flexform.fields_filter
source: Fields for filtering
de: Felder für Filtern

# flexform.according_filter_field
source: According filter field
de: Zugehöriges Filter-Feld

# flexform.filter_options
source: Options for filters
de: Optionen für Filter

# flexform.field_option_name
source: Option Name
de: Name der Option

# flexform.field_option_value
source: Option Value
de: Wert der Option

# flexform.field_option_condition
source: Option Condition
de: Option Bedingung

# flexform.field_condition
source: Field Condition
de: Feld Bedingung

# flexform.filter_combination
source: Filter Combination
de: Filter Kombination

# flexform.value
source: Value
de: Wert

# flexform.condition
source: Cond.
de: Bed.

# flexform.allowed_actions
source: Allowed Actions on Controller
de: Erlaubte Aktionen am Controller

# flexform.action_new
source: post (Create Record)
de: post (Datensatz erstellen)

# flexform.action_edit
source: post (Edit Record)
de: post (Datensatz bearbeiten)

# flexform.action_delete
source: delete (Delete Record)
de: delete (Datensatz löschen)

# flexform.redirect_settings
source: Redirect Settings
de: Weiterleitungen

# flexform.redirect_success_new
source: Redirect after successful creation
de: Weiterleitung nach erfolgreicher Neuanlage

# flexform.redirect_success_edit
source: Redirect after successful editing
de: Weiterleitung nach erfolgreicher Bearbeitung

# flexform.redirect_success_delete
source: Redirect after successful deletion
de: Weiterleitung nach erfolgreicher Löschung

# flexform.filter_type
source: Filter Frontend Type
de: Filter Frontendtyp

# flexform.filter_type_from_to
source: From - To
de: Von - Bis

# flexform.filter_type_input
source: Input Field
de: Eingabefeld

# flexform.search_type
source: Search type configuration
de: Suchtyp Konfiguration

# flexform.search_type.title
source: Search through record title
de: Suche anhand Datensatztitel

# flexform.search_type.fields
source: Search through fields
de: Suche anhand Feldwerten

# flexform.search_type.title_fields
source: Search through record title and fields
de: Suche anhand Datensatztitel und Feldwerten

# flexform.preselected_letter
source: Preselected letter
de: Vorausgewählter Anfangsbuchstabe

# flexform.preselected_records
source: Preselected records
de: Vorausgewählte Datensätze

# flexform.show_images
source: Show according images
de: Zugehörige Bilder anzeigen

# flexform.show_value_text
source: Show value text
de: Text anzeigen

# flexform.show_empty_values
source: Show empty values
de: Leere Werte anzeigen

# flexform.is_image_link
source: Show Image Options
de: Bildoptionen anzeigen

# flexform.display_cond
source: Display Conditions
de: Anzeigebedingungen

# flexform.direct_render_part
source: Directly Render the Selected Part
de: Direktes Rendern des ausgewählten Teils

# flexform.force_sorting
source: Force these sorting settings
de: Diese Sortierungseinstellungen erzwingen

# allowed_table
source: Allowed record table
de: Erlaubte Datensatz-Tabelle

# model_class
source: Class Name of the according model (Leave Blank for Array-Return)
de: Klassenname des zugehörigen Domain-Models (Leer lassen für Array-Rückgabe)

# flexform.number_of_initial_records
source: Initial Number of records to show
de: Standard-Anzahl von anzuzeigenden Datensätzen

# flexform.number_of_records
source: Number of records
de: Anzahl von Datensätzen

# flexform.default_sort_order
source: Default Sort Order
de: Standard-Sortierun

# flexform.sort_order_ascending
source: Ascending
de: Aufsteigend

# flexform.sort_order_descending
source: Descending
de: Absteigend

# flexform.sort_fields
source: Fields for sorting
de: Felder für Sortierung

# flexform.per_page_entries
source: List of entries for 'Per Page'-Field. (Comma separated)
de: Einträge im 'pro Seite' Feld. (Kommasepariert)

# flexform.selected_per_page
source: Default Selected 'Items per Page'-Value
de: Standardauswahl für 'pro Seite'

# flexform.template_selection
source: Template Selection
de: Templateauswahl

# flexform.custom_template_path
source: Select custom template path
de: Eigenen Templatepfad auswählen

# flexform.predefined_templates
source: Predefined Templates
de: Vordefinierte Templates

# flexform.divide_records
source: Divide records
de: Datensätze trennen

# flexform.divide_by_datatypes
source: Divide records by datatypes
de: Datensätze nach Datentypen trennen

# flexform.divide_by_fields
source: Divide records by fields
de: Datensätze nach Feldern trennen

# flexform.fluent_display
source: Fluent display of all records
de: Fortführende Anzeige aller Datensätze

# flexform.show_paginator
source: Show pagination
de: Seiten umbrechen

# flexform.default_sort_field
source: Default sort field
de: Standardsortierung

# flexform.crdate
source: Creation Date
de: Erstellungsdatum

# flexform.sorting
source: Sorting
de: Sortierung

# flexform.detail_page_id
source: Page for Detail View
de: Seite für Detailansicht

# flexform.list_page_id
source: Page for List View
de: Seite für Listenansicht

# flexform.record_save_datatype
source: Record-Datatype for the Storage
de: Datensatz-Datentyp für die Speicherung

# flexform.file_upload_folder
source: File Upload Folder
de: Dateiupload-Ordner

# plugin_types.display
source: Display Record Plugins
de: Plugins um Datensätze anzuzeigen

# plugin_types.manipulation
source: Record Manipulation Plugins
de: Plugins um die Datensatzanzeige zu ändern

# plugin_type.list
source: List
de: Liste

# plugin_type.detail
source: Detail
de: Einzelansicht

# plugin_type.part
source: Part from a record
de: Teil eines Datensatzes

# plugin_type.dynamic_detail
source: Dynamic Detail
de: Dynamische Einzelansicht

# plugin_type.search
source: Search Form
de: Suchformular

# plugin_type.letterselect
source: Letter Selection
de: Anfangsbuchstabenauswahl

# plugin_type.sort
source: Sort Form
de: Sortierungsformular

# plugin_type.please_select
source: -- Please select a plugin type --
de: -- Bitte wählen Sie einen Plugintyp --

# plugin.wizarditem_pi1
source: Display Records
de: Datensätze anzeigen

# plugin.wizarditem_pi2
source: Insert Searchform
de: Suchformular einfügen

# plugin.wizarditem_pi3
source: Insert Letter Selection
de: Buchstabenauswahl einfügen

# plugin.wizarditem_pi4
source: Insert Sorting Form
de: Sortierungsformular einfügen

# plugin.wizarditem_pi5
source: Insert Filtering Form
de: Filter-Formular einfügen

# plugin.wizarditem_pi6
source: Insert Record Selection
de: Datensatzauswahl anzeigen

# plugin.wizarditem_pi7
source: Record Save Form
de: Datensatz-Speichern Formular

# plugin.wizarditem_pi1_description
source: Add records to your site. This plugin offers different possibilities to integrate records.
de: Fügen Sie Datensätze Ihrer Seite hinzu. Dieses Plugin ermöglicht unterschiedliche Anzeigearten von Datensätzen.

# plugin.wizarditem_pi2_description
source: Adds a search form to your site to search record contents.
de: Fügt ein Suchformular der Seite hinzu um in Datensätzen zu suchen.

# plugin.wizarditem_pi3_description
source: Add a letter selection (A,B,C etc.) to your site to filter records by the selected letter.
de: Fügt eine Buchstabenauswahl hinzu um Datensätze nach Anfangsbuchstaben eines Feldes zu filtern.

# plugin.wizarditem_pi4_description
source: Add a form for sorting records to your site.
de: Fügt ein Sortierungsformular der Seite hinzu um Datensätze nach Feldern zu sortieren.

# plugin.wizarditem_pi5_description
source: Adds an filter form to your site to show only records that are valid for the selected filters.
de: Fügt ein Filterformular der Seite hinzu um Datensätze nach Feldern zu filtern.

# plugin.wizarditem_pi6_description
source: Adds an record selection form to your site where records can be selected and used in the record plugin.
de: Fügt ein Auswahlformular für Datensätze ein, welche im 'Datensätze anzeigen'-Plugin verwendet werden können.

# plugin.wizarditem_pi7_description
source: Adds an Form to the site for saving and validating form data which is passed from a template.
de: Fügt ein Formular der Seite hinzu, zum Speichern und Auswerten von Formulardaten, welche über ein Template übergeben werden.

# message.no_plugin_type_selected
source: No plugin type selected
de: Kein Plugintyp ausgewählt

# message.please_select_a_plugin_type
source: Please select a plugin type in the plugin settings
de: Bitte wählen Sie einen Plugintyp in den Einstellungen aus

# message.this_field_has_no_configuration
source: This field has no configuration.
de: Dieses Feld besitzt keine Konfiguration.

# message.no_fieldtypes_found_please_check_ts
source: No fieldtypes found. Please add the DataViewer Static to your site-template or add at least one fieldtype (plugin.tx_dataviewer.fieldtypes)
de: Es wurden keine Feldtypen gefunden. Bitte fügen Sie das DataViewer Static Ihrem Seitentemplate hinzu oder fügen Sie manuell einen Feldtypen hinzu (plugin.tx_dataviewer.fieldtypes)

# message.no_record_storage_page_configured
source: No Record Storage Page is configured. Please first add a Record Storage Page and press 'Save'.
de: Es wurde keine Datensatzsammlung angegeben. Bitte wählen Sie zuerst einen Datenordner aus und drücken Sie auf 'Speichern'.

# message.use_this_id_to_link
source: Use this id in the 'Target record display plugin'-Setting for Linking other DataViewer plugins to this!
de: Benutzen Sie diese Id in der Einstellung 'Zielplugin der Datensatz-Anzeige', um andere DataViewer-Plugins hiermit zu verknüpfen!

# message.creating_not_allowed
source: Sorry, creating new records is not allowed by this plugin!
de: Entschuldigung, die Erstellung von Datensätzen ist über dieses Plugin nicht erlaubt!

# message.editing_not_allowed
source: Sorry, editing records is not allowed by this plugin!
de: Entschuldigung, das Bearbeiten von Datensätzen ist über dieses Plugin nicht erlaubt!

# message.deleting_not_allowed
source: Sorry, deleting records is not allowed by this plugin!
de: Entschuldigung, das Löschen von Datensätzen ist über dieses Plugin nicht erlaubt!

# message.caches_cleared
source: The DataViewer Extension had to clear the cache to reload all fieldtypes. If there are no fieldtypes available, please try to clear the caches manually.
de: Die DataViewer Extension hat alle Caches geleert um die Feldtypen neu zu laden. Sollten keine Feldtypen verfügbar sein, leeren Sie bitte die Caches manuell.

source: No configuration.
de: Keine Konfiguration.

source: Appearance
de: Anzeige

# see_tca_reference
source: See TCA Reference for more information.
de: Bitte beachten Sie die TCA-Referenz Dokumentation für weitere Informationen.

# tx_dataviewer_domain_model_datatype
source: Datatype
de: Datentyp

# tx_dataviewer_domain_model_datatype.description
source: Description
de: Beschreibung

# tx_dataviewer_domain_model_datatype.templatefile
source: Template File for Rendering (PartViewHelper)
de: Templatedatei für Rendering (PartViewHelper)

# tx_dataviewer_domain_model_datatype.fields
source: Fields
de: Felder

# tx_dataviewer_domain_model_datatype.color
source: Color
de: Farbe

# tx_dataviewer_domain_model_datatype.hide_records
source: Hide Records of this type in lists
de: Datensätze dieses Typs in Listen verstecken

# tx_dataviewer_domain_model_datatype.hide_add
source: Hide Button to Add new Record
de: Button verstecken um neue Datensätze zu erstellen

# tx_dataviewer_domain_model_datatype.title_divider
source: Title Divider Character
de: Titel Trennzeichen

# tx_dataviewer_domain_model_field
source: Field
de: Feld

# tx_dataviewer_domain_model_field.is_active
source: Show in Record
de: In Datensätzen anzeigen

# tx_dataviewer_domain_model_field.type
source: Type
de: Typ

# tx_dataviewer_domain_model_field.variable_name
source: Custom Variable Name
de: Eigener Variablenname

# tx_dataviewer_domain_model_field.description
source: Backend Description
de: Backend Beschreibung

# tx_dataviewer_domain_model_field.css_class
source: Backend Css Class
de: Backend CSS Klasse

# tx_dataviewer_domain_model_field.unit
source: Unit / Additional Text
de: Einheit / Angehängter Text

# tx_dataviewer_domain_model_field.column_width
source: Backend Column Width
de: Spaltenbreite

# tx_dataviewer_domain_model_field.tab_name
source: Name of the Tab to add to
de: Name des Tabs zu dem dieser Eintrag hinzugefügt werden soll

# tx_dataviewer_domain_model_field.show_title
source: Show Title
de: Titel anzeigen

# tx_dataviewer_domain_model_field.is_record_title
source: Use as record title
de: Als Datensatz-Titel benutzen

# tx_dataviewer_domain_model_field.validation
source: Field Validation
de: Feldvalidierung

# tx_dataviewer_domain_model_field.field_configuration
source: Field Configuration
de: Feldkonfiguration

# tx_dataviewer_domain_model_field.display_cond
source: Display Conditions
de: Anzeigebedingungen (Display Conditions)

# tx_dataviewer_domain_model_field.request_update
source: Request Update (onChange)
de: Bei Ändern neuladen

# tx_dataviewer_domain_model_field.field_values
source: Field Values
de: Feldwerte

# tx_dataviewer_domain_model_field.templatefile
source: Template File for Part-Rendering (PartViewHelper)
de: Templatedatei für Teil-Rendering (PartViewHelper)

# tx_dataviewer_domain_model_field.exclude
source: Exclude for non-admin users
de: Ausschließen für Nicht-Administratoren

# tx_dataviewer_domain_model_fieldvalue
source: Field Value
de: Feldwert

# tx_dataviewer_domain_model_fieldvalue.type
source: Type
de: Typ

# tx_dataviewer_domain_model_fieldvalue.value_content
source: Value Content
de: Wertinhalt

# tx_dataviewer_domain_model_fieldvalue.field_content
source: Field Content
de: Feldinhalt

# tx_dataviewer_domain_model_fieldvalue.table_content
source: Table Content
de: Tabellenname

# tx_dataviewer_domain_model_fieldvalue.column_name
source: Column Name
de: Spaltenname

# tx_dataviewer_domain_model_fieldvalue.where_clause
source: Where Clause
de: WHERE-Bedingung

# tx_dataviewer_domain_model_fieldvalue.pass_to_fe
source: Pass Value to Frontend
de: Wert ans Frontend weitergeben

# tx_dataviewer_domain_model_fieldvalue.is_readonly
source: Is Readonly
de: Nur lesen

# tx_dataviewer_domain_model_fieldvalue.is_default
source: Is Default
de: Standardwert

# tx_dataviewer_domain_model_fieldvalue.pretends_empty
source: Pretends to be an empty value
de: Als leeren Wert darstellen

# tx_dataviewer_domain_model_record
source: Record
de: Datensatz

# tx_dataviewer_domain_model_record.uid
source: Record Uid
de: Uid

# tx_dataviewer_domain_model_record.datatype
source: Datatype
de: Datentyp

# tx_dataviewer_domain_model_record.record_values
source: Record Values
de: Datensatz-Werte

# tx_dataviewer_domain_model_record.title
source: Record Title
de: Datensatztitel

# tx_dataviewer_domain_model_recordvalue
source: Record Value
de: Datensatz Wert

# tx_dataviewer_domain_model_recordvalue.value_content
source: Value Content
de: Wertinhalt

# tx_dataviewer_domain_model_recordvalue.record
source: Record
de: Datensatz

# tx_dataviewer_domain_model_recordvalue.field
source: Field
de: Feld

# tx_dataviewer_domain_model_variable.type
source: Type
de: Typ

# tx_dataviewer_domain_model_variable.variable_value
source: Value
de: Wert

# tx_dataviewer_domain_model_variable.record
source: Record
de: Datensatz

# tx_dataviewer_domain_model_variable.field
source: Field
de: Feld

# tx_dataviewer_domain_model_variable.table_content
source: Table
de: Tabelle

# tx_dataviewer_domain_model_variable.column_name
source: Column
de: Spalte

# tx_dataviewer_domain_model_variable.where_clause
source: Where Clause
de: WHERE-Bedingung

# tx_dataviewer_domain_model_variable.server
source: SERVER Environment
de: SERVER Umgebung

# tx_dataviewer_domain_model_variable.page
source: Page
de: Seite

# please_select_datatype
source: -- Please select a datatype --
de: -- Bitte wählen Sie einen Datentyp --

# please_select_datatype_to_continue
source: Please select a datatype to continue
de: Bitte wählen Sie einen Datentyp um fortzufahren

source: Datatype not found
de: Datentyp nicht gefunden

source: Field not found
de: Feld nicht gefunden

# datatype_not_selected
source: No Datatype selected
de: Kein Datentyp ausgewählt

# no_support_for_different_fieldvalues
source: This field doesn't support different field value types. Please add a fixed value!
de: Dieses Feld unterstützt nur feste Werte!

# no_support_for_dynamic_database_values
source: This fieldtype doesn't support dynamic database values.
de: Dieser Feldtyp unterstützt keine dynamischen Datenbankwerte.

# no_support_for_dynamic_database_or_database_values
source: This fieldtype doesn't support database and dynamic database values.
de: Dieser Feldtyp unterstützt keine (dynamischen) Datenbankwerte.

# field_has_no_field_values
source: The field '%s' has no field values. Please add at least one field value!
de: >Dieses Feld besitzt keine Feldwerte. Bitte fügen Sie mindestens einen Feldwert hinzu!

# no_inline_configuration_for_field_type_available
source: There is currently no inline configuration available for this field type!
de: Es gibt zur Zeit noch keine Inline-Konfiguration für diesen Feldtyp!

# datatype_has_no_fields
source: Datatype does not contain fields. Please add fields to this datatype.
de: Dieser Datentyp hat noch keine Felder. Bitte fügen Sie Felder hinzu!

# record_not_found
source: Record with Id '%s' not found.
de: Datensatz mit Id '%s' wurde nicht gefunden.

source: No record content given.
de: Kein Datensatzinhalt gefunden.

# no_flexform_content_given
source: No flexform default content given.
de: Kein FlexForm Standardinhalt gefunden.

source: No records found.
de: Keine Datensätze gefunden.

# record_was_successfully_deleted
source: Record with Id '%s' was successfully deleted.
de: Datensatz mit Id '%s' wurde erfolgreich gelöscht.

# could_not_delete_record
source: Could not delete Record with Id '%s'.
de: Datensatz mit Id '%s' konnte nicht gelöscht werden.

# record_was_successfully_saved
source: Record '%s' (%s) was successfully saved.
de: Datensatz '%s' (%s) wurde erfolgreich gespeichert.

# field_was_successfully_saved
source: Field '%s' (%s) was successfully saved.
de: Feld '%s' (%s) wurde erfolgreich gespeichert.

# field_was_successfully_deleted
source: Field with Id '%s' and according record values were successfully deleted.
de: Das Feld mit Id '%s' sowie zugehörige Feldwerte wurden erfolgreich gelöscht.

# fieldvalue_was_successfully_deleted
source: FieldValue with Id '%s' and according record values were successfully deleted.
de: Der Feldwert mit Id '%s' sowie zugehörige Datensatzwerte wurden erfolgreich gelöscht.

# datatype_was_successfully_saved
source: Datatype '%s' (%s) was successfully saved.
de: Datentyp '%s' (%s) wurde erfolgreich gespeichert.

# field_is_required
source: The field '%s' is required. Please fill out all values.
de: Feld '%s' ist ein Pflichtfeld. Bitte füllen Sie das Feld aus.

# database_value_is_required_for_inline_element
source: The inline element only works with database field values.
de: Dieses Inline-Element funktioniert nur mit Datenbankwerten.

# database_value_is_required_for_database_element
source: The database element only works with database field values.
de: Dieses Datenbank-Element funktioniert nur mit Datenbankwerten.

# not_configured
source: This plugin is not yet configured.
de: Plugin wurde noch nicht konfiguriert.

# datatype_not_saved
source: Unable to save datatype.
de: Datentyp konnte nicht gespeichert werden.

# record_not_saved
source: Unable to save record.
de: Datensatz konnte nicht gespeichert werden.

# record_invalid
source: Record is now hidden. Please fix the displayed errors first and then remove the 'Hide'-Check.
de: Datensatz ist nun verborgen. Bitte beheben Sie die angezeigten Fehler zuerst und entfernen Sie dann das 'Verbergen'-Häkchen.

# items
source: Found Items (%s):
de: Gefundene Einträge (%s):

# number_records_found
source: %s Records found
de: %s Einträge gefunden

source: (Empty)
de: (leer)

source: Page
de: Seite

# entry
source: Entry Id %s
de: Eintrag Id %s

# dynamic_value
source: Attach Values from Database for Frontend
de: Werte aus Datenbank dem Frontend hinzufügen

source: Required
de: Pflichtfeld

# formvalue_access_to_hidden_field
source: The Form-Value is accessible in frontend with the following fluid code:
de: Dieser Formularwert ist im Frontend über den folgenden Fluid-Code erreichbar:

source: Available Field Ids:
de: Verfügbare Feld-Ids:

source: Back to record list
de: Zurück zur Datensatzliste

# search_requires_characters
source: The search requires minimum of %s characters.
de: Die Mindestlänge für die Suche beträgt %s Zeichen.
